results/test1/file/a/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [w(4)][100.0%][w=11.7MiB/s][w=3001 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1092: Sat Mar 16 18:55:19 2024
  write: IOPS=1556, BW=6226KiB/s (6376kB/s)(367MiB/60284msec); 0 zone resets
    slat (nsec): min=531, max=54421k, avg=93645.31, stdev=548796.35
    clat (nsec): min=531, max=1033.7M, avg=4834734.40, stdev=53024701.22
     lat (usec): min=18, max=1033.7k, avg=4928.38, stdev=53023.55
    clat percentiles (nsec):
     |  1.00th=[      852],  5.00th=[     2736], 10.00th=[    16512],
     | 20.00th=[   216064], 30.00th=[   321536], 40.00th=[   436224],
     | 50.00th=[   552960], 60.00th=[   700416], 70.00th=[   913408],
     | 80.00th=[  1269760], 90.00th=[  2007040], 95.00th=[  3162112],
     | 99.00th=[ 21889024], 99.50th=[189792256], 99.90th=[868220928],
     | 99.95th=[918552576], 99.99th=[994050048]
   bw (  KiB/s): min=  504, max=18918, per=31.86%, avg=8068.36, stdev=4166.96, samples=92
   iops        : min=  126, max= 4729, avg=2016.99, stdev=1041.71, samples=92
  lat (nsec)   : 750=0.64%, 1000=0.73%
  lat (usec)   : 2=2.33%, 4=2.69%, 10=2.40%, 20=1.76%, 50=1.87%
  lat (usec)   : 100=1.84%, 250=9.35%, 500=22.48%, 750=16.55%, 1000=10.58%
  lat (msec)   : 2=16.72%, 4=6.51%, 10=1.97%, 20=0.53%, 50=0.40%
  lat (msec)   : 100=0.06%, 250=0.12%, 500=0.04%, 750=0.18%, 1000=0.26%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.84%, sys=32.58%, ctx=206040, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.9%, 4=55.1%, 8=38.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.4%, 8=4.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,93836,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1093: Sat Mar 16 18:55:19 2024
  write: IOPS=1610, BW=6441KiB/s (6595kB/s)(379MiB/60284msec); 0 zone resets
    slat (nsec): min=440, max=41908k, avg=84051.62, stdev=502590.54
    clat (nsec): min=561, max=1040.8M, avg=4685926.99, stdev=52116589.37
     lat (usec): min=20, max=1040.8k, avg=4769.98, stdev=52115.51
    clat percentiles (nsec):
     |  1.00th=[     1128],  5.00th=[     4320], 10.00th=[    38144],
     | 20.00th=[   236544], 30.00th=[   333824], 40.00th=[   440320],
     | 50.00th=[   544768], 60.00th=[   692224], 70.00th=[   897024],
     | 80.00th=[  1236992], 90.00th=[  1957888], 95.00th=[  2998272],
     | 99.00th=[ 20578304], 99.50th=[181403648], 99.90th=[868220928],
     | 99.95th=[910163968], 99.99th=[985661440]
   bw (  KiB/s): min=  448, max=18417, per=32.86%, avg=8320.97, stdev=4242.81, samples=92
   iops        : min=  112, max= 4604, avg=2080.16, stdev=1060.66, samples=92
  lat (nsec)   : 750=0.30%, 1000=0.48%
  lat (usec)   : 2=1.83%, 4=2.19%, 10=2.22%, 20=1.53%, 50=1.88%
  lat (usec)   : 100=1.73%, 250=9.49%, 500=24.43%, 750=17.29%, 1000=10.45%
  lat (msec)   : 2=16.49%, 4=6.44%, 10=1.74%, 20=0.49%, 50=0.40%
  lat (msec)   : 100=0.03%, 250=0.13%, 500=0.03%, 750=0.17%, 1000=0.26%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.96%, sys=33.97%, ctx=210402, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.7%, 4=54.4%, 8=39.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.5%, 8=4.5%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,97068,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1094: Sat Mar 16 18:55:19 2024
  write: IOPS=1541, BW=6167KiB/s (6315kB/s)(363MiB/60290msec); 0 zone resets
    slat (nsec): min=471, max=60393k, avg=95008.83, stdev=599356.04
    clat (nsec): min=551, max=1049.6M, avg=4879324.25, stdev=53287317.96
     lat (usec): min=19, max=1049.6k, avg=4974.33, stdev=53286.69
    clat percentiles (nsec):
     |  1.00th=[      996],  5.00th=[     3184], 10.00th=[    20608],
     | 20.00th=[   214016], 30.00th=[   317440], 40.00th=[   432128],
     | 50.00th=[   544768], 60.00th=[   692224], 70.00th=[   897024],
     | 80.00th=[  1253376], 90.00th=[  1990656], 95.00th=[  3096576],
     | 99.00th=[ 22937600], 99.50th=[208666624], 99.90th=[868220928],
     | 99.95th=[918552576], 99.99th=[994050048]
   bw (  KiB/s): min=  544, max=17101, per=31.47%, avg=7969.00, stdev=3883.25, samples=92
   iops        : min=  136, max= 4275, avg=1992.15, stdev=970.77, samples=92
  lat (nsec)   : 750=0.45%, 1000=0.57%
  lat (usec)   : 2=2.22%, 4=2.47%, 10=2.43%, 20=1.76%, 50=2.01%
  lat (usec)   : 100=2.12%, 250=9.75%, 500=22.86%, 750=16.43%, 1000=10.32%
  lat (msec)   : 2=16.63%, 4=6.50%, 10=1.83%, 20=0.52%, 50=0.45%
  lat (msec)   : 100=0.08%, 250=0.12%, 500=0.04%, 750=0.19%, 1000=0.26%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.83%, sys=32.21%, ctx=203003, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.7%, 4=55.7%, 8=37.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.3%, 8=4.7%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,92954,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1095: Sat Mar 16 18:55:19 2024
  write: IOPS=1623, BW=6494KiB/s (6650kB/s)(382MiB/60247msec); 0 zone resets
    slat (nsec): min=521, max=55299k, avg=72930.07, stdev=502709.60
    clat (nsec): min=541, max=1040.6M, avg=4694685.41, stdev=51940856.95
     lat (usec): min=18, max=1040.6k, avg=4767.62, stdev=51944.45
    clat percentiles (nsec):
     |  1.00th=[      892],  5.00th=[     3472], 10.00th=[    50432],
     | 20.00th=[   232448], 30.00th=[   342016], 40.00th=[   444416],
     | 50.00th=[   552960], 60.00th=[   700416], 70.00th=[   913408],
     | 80.00th=[  1253376], 90.00th=[  2007040], 95.00th=[  3096576],
     | 99.00th=[ 21102592], 99.50th=[170917888], 99.90th=[868220928],
     | 99.95th=[918552576], 99.99th=[994050048]
   bw (  KiB/s): min=  360, max=18730, per=33.09%, avg=8379.40, stdev=4187.23, samples=92
   iops        : min=   90, max= 4682, avg=2094.74, stdev=1046.77, samples=92
  lat (nsec)   : 750=0.61%, 1000=0.62%
  lat (usec)   : 2=2.05%, 4=2.04%, 10=1.78%, 20=1.37%, 50=1.52%
  lat (usec)   : 100=1.94%, 250=10.00%, 500=23.67%, 750=17.10%, 1000=10.59%
  lat (msec)   : 2=16.71%, 4=6.52%, 10=1.86%, 20=0.55%, 50=0.43%
  lat (msec)   : 100=0.06%, 250=0.13%, 500=0.03%, 750=0.17%, 1000=0.25%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.96%, sys=34.26%, ctx=213982, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.7%, 4=53.3%, 8=41.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.1%, 8=3.9%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,97809,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=24.7MiB/s (25.9MB/s), 6167KiB/s-6494KiB/s (6315kB/s-6650kB/s), io=1491MiB (1563MB), run=60247-60290msec